"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.
"""
n = int(input(f"Введите число n : "))
count = 0
result = 1
while result * 2 <= n:
    result *= 2
    count += 1
    print(f" {count} степень двойки : {result}.")
